<!-- terraform-plan-comment -->
## Terraform Plan Results

**Commit:** `67c847e97e5e8578387bd905a6d4b91a0c53fc0d`
**Message:** fix: create cw log group

<details>
<summary>Show Plan Output</summary>

```terraform
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=c3f069b77a18594e043e8e4a55fd0f7f8f19f4f0]
cloudflare_turnstile_widget.ifs_widget: Refreshing state... [id=0x4AAAAAACZ8FGkiyBlJ5f7M]
cloudflare_record.vercel_landing_cname[0]: Refreshing state... [id=09fda2364fd0bdf2c0a11c6702261752]
aws_acm_certificate.subdomain_cert: Refreshing state... [id=arn:aws:acm:us-east-1:533267177082:certificate/7ec35bb5-81ab-441c-8ef0-4a0804a82e9d]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
cloudflare_record.acm_certificate_cname: Refreshing state... [id=8fba275c16601a9e9facf00a351026c2]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E1CER2APENQ1UU]
aws_iam_role.lambda_role: Refreshing state... [id=ifs_lambda_role]
aws_s3_bucket.main_bucket: Refreshing state... [id=ifs-storage-bucket]
aws_lambda_function.upload_function: Refreshing state... [id=ifs_upload_function]
aws_lambda_function_url.upload_function_url: Refreshing state... [id=ifs_upload_function]
aws_s3_bucket_public_access_block.allow_public_acl: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_website_configuration.s3_site_config: Refreshing state... [id=ifs-storage-bucket]
aws_iam_policy.allow_s3_access: Refreshing state... [id=arn:aws:iam::533267177082:policy/ifs_s3_access_policy]
aws_s3_bucket_lifecycle_configuration.one_day_lifetime: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_cors_configuration.allow_cors: Refreshing state... [id=ifs-storage-bucket]
aws_s3_object.index_html: Refreshing state... [id=index.html]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2C9XYLKDNE51M]
aws_iam_role_policy_attachment.combined_policy_attachment: Refreshing state... [id=ifs_lambda_role/arn:aws:iam::533267177082:policy/ifs_s3_access_policy]
cloudflare_record.cloudfront_to_subdomain_cname: Refreshing state... [id=df1f447d6d68314b15b5e2ac8132a13b]
aws_s3_bucket_policy.main_bucket_policy: Refreshing state... [id=ifs-storage-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.upload_function_log_group will be created
  + resource "aws_cloudwatch_log_group" "upload_function_log_group" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/ifs_upload_function"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = (known after apply)
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = "ifs_lambda_logging"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ifs_lambda_role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>